Repository: sergey88889999/y-tube-dl
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: ru_ru

source: Enter YouTube video URL (Press ENTER to exit):
ru_ru: Введите URL-адрес видео на YouTube (нажмите ENTER для выхода):

source: Available download options:
ru_ru: Доступные варианты загрузки:

source: Resolution: %(resolution)s, Format: %(mime_type)s, Type: %(type)s, Quality: %(abr)s
ru_ru: Разрешение: %(resolution)s, Формат: %(mime_type)s, Тип: %(type)s, Качество: %(abr)s

source: Starting download of file: %(title)s.%(file_extension)s
ru_ru: Начало загрузки файла: %(title)s.%(file_extension)s

source: Video successfully downloaded!
ru_ru: Видео успешно загружено!

source: Error: Invalid YouTube video URL.
ru_ru: Ошибка: Некорректный URL-адрес видео на YouTube.

source: An error occurred while downloading the video: %(exception_type)s: %(exception_message)s
ru_ru: Произошла ошибка во время загрузки видео: %(exception_type)s: %(exception_message)s

source: Linux terminal utility v.0.0.1 - that downloads videos from YouTube using a provided link.
ru_ru: Утилита для терминала Linux v.0.0.1 - для загрузки видео с YouTube по предоставленной ссылке.

source: Uploaded: %(percentage).2f%% | Remaining Time: %(formatted_remaining_time)s (upload time: %(formatted_elapsed_time)s)
ru_ru: Загружено: %(percentage).2f%% | Оставшееся время: %(formatted_remaining_time)s (время загрузки: %(formatted_elapsed_time)s)

source: usage:
ru_ru: использование:

source: options:
ru_ru: опции:

source: URL - link to the YouTube video
ru_ru: URL - ссылка на видео с YouTube

source: usage: y-tube-dl [-h] [--URL URL]; by default, it starts in interactive mode with limited functionality.
ru_ru: используйте: y-tube-dl [-h] [--URL URL]; по умолчанию запускается в интерактивном режиме с ограниченным функционалом.
